{"date": "January 22", "year": "2021", "pfp": "pfp.jpeg", "author": "Mason Spencer Lives On", "url": "", "links": [{"title": "some title", "url": "https://ilprairiecf.org/mason-spencer-lives-on-fund"}], "message": [{"content": "Today we should be celebrating Mason’s 21st birthday. Instead, we celebrate the 15 years we had with him. He is missed every day and the wonders of what he would be doing now never end. One thing for sure, he would be having a big party. As all of his friends certainly remember, he had a birthday party every year. He would start talking about the birthday party he would have next year as soon as this one ended.", "type": "Paragraph"}, {"content": "Thanks to Cincinnati Children’s and Austin’s selfless donor, in the last week we celebrated his 7th re-birthday and 24th birthday.  To help others have an outcome like Austin vs Mason, Mason’s foundation continues to donate to research at Cincinnati Children’s.  We were intending to hold a fundraiser last year to aid our mission. Unfortunately, due to COVID-19 that didn’t happen and wont this year either. Currently we are in the process of making a donation to Cincinnati Children’s for research. Dr Marsh has just sent the list of projects for us to choose from. Once we make our choice and send our donation the project(s) and amount will be posted.", "type": "Paragraph"}, {"content": "Please help us celebrate Mason’s 15 years on earth at what should be his 21st birthday with a donation to the foundation.", "type": "Paragraph"}, {"content": "To donate online click on the donate button AT THE BOTTOM of the Fund description: https://ilprairiecf.org/mason-spencer-lives-on-fund **it should say Mason Spencer Lives On in your PayPal donation window or you have clicked the incorrect donate button", "type": "Bullet"}, {"content": "To donate by phone with a credit card: Call 309-662-4477", "type": "Bullet"}, {"content": "To donate with a check by mail: Make your check payable to \"IPCF-Mason Spencer Lives On”  Mail to Illinois Prairie Community Foundation, 915 E. Washington St., Suite 2, Bloomington, IL 61701.", "type": "Bullet"}, {"content": "Details about the foundation. Each year the foundation gives a $500 scholarship to a graduating TV student, $75 award to an 8th grade basketball player, and to date has contributed $20,000 to Cincinnati Children’s for research. We choose the projects the funds are directed to. We target ones which would benefit those in Mason’s situation (with XIAP or GVHD related). The projects chosen to date are:", "type": "Paragraph"}, {"content": "Graft Versus Host Disease Research  (Helped fund the Mice portion which was unfunded) There was a funded project to validate a human peripheral blood screening test for acute GVHD (to detect it before symptoms develop), but an unfunded related project to develop the same test in mice and test different treatments in transplanted mice using the same blood test to detect acute GVHD before it develops.  They were doing this so that hopefully they were successful and hopefully had human trial of pre-emptive treatment in patients with positive screening results in a few years, would know what agents to use/what should work best", "type": "Bullet"}, {"content": "Dr. Khandelwal's work targeting prevention of GI GVHD (gastrointestinal graft vs host disease).", "type": "Bullet"}, {"content": "Dr. Marsh’s XIAP work on targeted treatments.", "type": "Bullet"}, {"content": "Pilot study of an antioxidant/anti-inflammatory medicine as a possible treatment for XIAP deficiency to decrease IL-18 levels which cause inflammation.  The pilot essentially consists of patients taking it for several weeks and we measure IL18 levels before, during, and after.", "type": "Bullet"}, {"content": "Continued work on a blood screening test for GVHD (gastrointestinal graft vs host disease) which we started with the mice portion.", "type": "Bullet"}]}
